Autodesk.Revit.DB.ColorFillSchemeEntry.IsValidFillPatternId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether ElementId identifies a valid FillPattern or is ElementId.InvalidElementId.
document:
The document.
id:
ElementId to check.
Returns:
Returns true if ElementId identifies a valid FillPattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.GetDoubleValue
Provides access to the double precision number within the entry.
Remarks:
The GetDoubleValue method should only be used if the StorageType property returns that the internal contents of the entry is a double.
Returns:
The double value contained in the entry.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.GetIntegerValue
Provides access to the integer number within the entry.
Remarks:
The GetIntegerValue method should only be used if the StorageType property returns that the internal contents of the entry is an integer.
Returns:
The integer value contained in the entry.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.GetStringValue
Provides access to the string contents of the entry.
Remarks:
The GetStringValue method should only be used if the StorageType property returns that the internal contents of the entry is a string.
Returns:
The string contained in the entry.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.SetFillPatternId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Sets fill pattern id.
Remarks:
To remove fill pattern id set ElementId.InvalidElementId.
document:
The document.
fillPatternId:
The fill pattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fillPatternId is invalid FillPattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType
Returns storage type of the entry.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.IsVisible
Returns true if current ColorFillSchemeEntry is visible in views, false otherwise.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.InUse
Returns true if there is at least one element which is colored by this ColorFillSchemeEntry
Remarks:
If entry is in use - it can not be deleted from the scheme.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.FillPatternId
The fill pattern Id applied to the ColorFillSchemeEntry,
or invalidElementId if no fill pattern applied.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.Color
The fill color of the entry.
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.ElementId)
Creates new instance of ColorFillSchemeEntry.
Remarks:
New instance will not be attached to any ColorFillScheme.
document:
The document.
value:
Value of the ColorFillSchemeEntry.
color:
The fill color of the entry.
fillPatternId:
The fill pattern Id applied to the ColorFillSchemeEntry,
or invalidElementId if no fill pattern applied.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fillPatternId is invalid FillPattern Id.
-or-
The element value does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.#ctor(Autodesk.Revit.DB.Document,System.Double,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.ElementId)
Creates new instance of ColorFillSchemeEntry.
Remarks:
New instance will not be attached to any ColorFillScheme.
document:
The document.
value:
Value of the ColorFillSchemeEntry.
color:
The fill color of the entry.
fillPatternId:
The fill pattern Id applied to the ColorFillSchemeEntry,
or invalidElementId if no fill pattern applied.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fillPatternId is invalid FillPattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.#ctor(Autodesk.Revit.DB.Document,System.Int32,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.ElementId)
Creates new instance of ColorFillSchemeEntry.
Remarks:
New instance will not be attached to any ColorFillScheme.
document:
The document.
value:
Value of the ColorFillSchemeEntry.
color:
The fill color of the entry.
fillPatternId:
The fill pattern Id applied to the ColorFillSchemeEntry,
or invalidElementId if no fill pattern applied.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fillPatternId is invalid FillPattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry.#ctor(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Color,Autodesk.Revit.DB.ElementId)
Creates new instance of ColorFillSchemeEntry.
Remarks:
New instance is not be attached to any ColorFillScheme yet.
document:
The document.
value:
Value of the ColorFillSchemeEntry.
color:
The fill color of the entry.
fillPatternId:
The fill pattern Id applied to the ColorFillSchemeEntry,
or invalidElementId if no fill pattern applied.
Throws Autodesk.Revit.Exceptions.ArgumentException:
value is an empty string or contains only whitespace.
-or-
value cannot include prohibited characters.
-or-
The fillPatternId is invalid FillPattern Id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.ColorFillSchemeEntry
Represents entry of the color fill scheme.
Since:
2021